# Калькулятор слів і символів.
while True:
    # Запитайте користувача про текстовий рядок
    text = input("Введіть текстовий рядок: ")
# Перевірте, чи введено число або пробіли
    if not text.strip():
        print("Помилка: Введіть текстовий рядок.")
    elif text.isdigit():
        print("Помилка: В рядку не повинно бути цифр. Спробуйте ще раз.")
    else:
        break
# Розділіть введений рядок на слова за допомогою пробілів
words = text.split()
# Ініціалізуйте лічильники слів
word_count = len(words)
 # Виведіть кількість слів
print("Кількість слів:", word_count)
# Виведіть слова та їх довжину (кількість символів)
for index , word in enumerate(words):
    print(f"Слово {index + 1}: {word}, кількість символів: {len(word)}")
#Кінець
print("Роботу завершено")
